app/controllers/users_controller.rb

  def show
    redirect_to user_path(current_user.id) unless params[:id]
    @user = User.find(params[:id]) if params[:id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]