app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (users.lat IS NOT NULL AND users.lng IS NOT NULL) AND (users.lat>23.94725230024863 AND users.lat<44.18703169975135 AND users.lng>-130.6105586920324 AND users.lng<-106.29213130796762) AND ((
---
  def index
    @users = User.within(700, :origin => [current_user.lat,current_user.lng]).where.not(id: current_user.id)

UPDATE "users" SET "bio" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["bio", "I like soccer."], ["updated_at", "2019-10-28 05:26:10.766955"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)